[{"id": "1i1xx1q", "author": "EatTheAndrewPencil", "title": "One of many reasons I'm okay with what's happening to this app", "discussion_type": null, "num_comments": 81, "ups": 25, "upvote_ratio": 0.61, "created_utc": 1736949408.0, "is_video": false, "selftext": "As much good as this app has brought, shit like this has plagued it since the start and they've done nothing to fix it. This is one of dozens of reports I've made about blatantly vile shit people post that gets \"no violations found\". Stuff like this, blatant racism, homophobia, dangerous conspiracies, misinformation, etc. Let this app burn."}, {"id": "1i0owv6", "author": "HotelTrivagoMate", "title": "I don’t think moving to another app is the move", "discussion_type": null, "num_comments": 23, "ups": 26, "upvote_ratio": 0.79, "created_utc": 1736803043.0, "is_video": false, "selftext": "When TikTok came around it was a silly app but more and more people joined and we made it into a true social media rather than apps like instagram or facebook that keep you in a rather small circle. The first reaction to the news was people trying to figure out where to go rather than getting pissed that  government was overreaching and silencing them. I feel like TikTok going away is the sign of the end of the age of social media. "}, {"id": "1hy4uzm", "author": "RandomQuestioners", "title": "Is there a way to download my tiktok music collection?", "discussion_type": null, "num_comments": 8, "ups": 4, "upvote_ratio": 0.84, "created_utc": 1736517183.0, "is_video": false, "selftext": "Hey I have a collection of like 6k songs. But in my shit country the apps being removed. I’ve looked into some apps like faves. But I want like a program on my laptop or something that I can download them. I’m not looking to pay for a subscription on anything. "}, {"id": "1i26n02", "author": "efroo-_-", "title": "Idk ", "discussion_type": null, "num_comments": 3, "ups": 60, "upvote_ratio": 0.92, "created_utc": 1736972128.0, "is_video": false, "selftext": ""}, {"id": "1i2pwrm", "author": "Alex321432", "title": "The Digital Boston Tea Party", "discussion_type": null, "num_comments": 77, "ups": 196, "upvote_ratio": 0.88, "created_utc": 1737037128.0, "is_video": false, "selftext": ""}, {"id": "1i00a9f", "author": "Substantial_Loss_514", "title": "What will replace TikTok?", "discussion_type": null, "num_comments": 59, "ups": 13, "upvote_ratio": 0.73, "created_utc": 1736724724.0, "is_video": false, "selftext": "When I was in high school, VINE was huge. Some major stars began on VINE. When we lost VINE, these influencers moved to YOUTUBE and then came TIKTOK. At least that is my memory. We have facebook REELS, instagram, and youtube shorts… but TIKTOK is known for its bottomless scrolling through short videos instantly upon opening the app. What is going to replace TIKTOK? I think VINE replaced TIKTOK in terms of culture and format. I do not believe instagram, facebook, or even youtube can do it. What’s next? Many social medias have a great downfall. People are going to want something that is a replacement for TIKTOK, but I don’t see them wanting instagram to do it. I don’t see FB doing it. Youtube would have to change the format of their app. Youtube could make a youtube shorts app, or do they have that? What is going to be that app that people end up HAVING to download because their friends are sharing videos, and the app format is just better? Opinions?"}, {"id": "1i343h3", "author": "DockBoggs157", "title": "What the actual fuck man ", "discussion_type": null, "num_comments": 7, "ups": 10, "upvote_ratio": 0.92, "created_utc": 1737074580.0, "is_video": false, "selftext": ""}, {"id": "1hn8dfj", "author": "Gargeroth6692", "title": "Why is this happening when the video has thousands of views fully", "discussion_type": null, "num_comments": 4, "ups": 4, "upvote_ratio": 1.0, "created_utc": 1735279050.0, "is_video": false, "selftext": ""}, {"id": "1hztu3w", "author": "Cafe_con_queque", "title": "Where is everyone in the US flocking to with TikTok being banned?", "discussion_type": null, "num_comments": 326, "ups": 77, "upvote_ratio": 0.72, "created_utc": 1736708053.0, "is_video": false, "selftext": "I don’t want to lose all the people I follow and I’m not finding many of them on Instagram. 😭💔\nIs everyone going to YouTube? Blue sky? Lemon8 is getting banned too right? "}, {"id": "1i0ugr2", "author": "AbigREDdinosaur", "title": "My thoughts on Red Note", "discussion_type": null, "num_comments": 7, "ups": 5, "upvote_ratio": 0.63, "created_utc": 1736817932.0, "is_video": false, "selftext": "Yes, I find it funny that everyone is going over to it in protest, however, everyone going over there will cause it to be banned also. There’s so many Chinese American citizens and students that use that app regularly that will wrongfully have it taken away from them just for the sake of a mass meme to try to prove a point that we know the government doesn’t actually care about. It’s wrong to do that to them. Let them have their thing."}, {"id": "1hrzqc6", "author": "Poomandu1", "title": "Can tik tok start banning these vexbolts comments?", "discussion_type": null, "num_comments": 5, "ups": 26, "upvote_ratio": 1.0, "created_utc": 1735840469.0, "is_video": false, "selftext": "I'm convinced this guy has an army of bots spamming his shitty ass account spamming his name all over tik tok. Who even is this guy? Seriously it's so annoying that the first comments are always VEXBOLTS IS AT 76K RIGHT NOW. Please fuck off"}, {"id": "1i1qguo", "author": "RinkyDink1629", "title": "Is there any (quick) way to download all my saved videos from tiktok before the app is banned?", "discussion_type": null, "num_comments": 27, "ups": 15, "upvote_ratio": 0.94, "created_utc": 1736918607.0, "is_video": false, "selftext": "So long story short as you guys know, the app is getting banned on the 19th, but I’m wondering if there’s a way to save all the useful videos I’ve compiled in my saved section over the years.\n\nCan’t believe it’s actually happening…☹️"}, {"id": "1i0uof4", "author": "twentysum", "title": "If TikTok is already banned in china... why is china such a big concern in conversation about the tiktok ban....", "discussion_type": null, "num_comments": 74, "ups": 7, "upvote_ratio": 0.59, "created_utc": 1736818562.0, "is_video": false, "selftext": "This doesn't make logical sense to me and I dont know why nobody has picked up on this. Tiktok is banned in china by region so you cant access it even by VPN. this makes no sense to me. How can china be behind the app if its banned in china..... someone please clarify this"}, {"id": "1i0672v", "author": "Necessary-Ad2240", "title": "Why doesn’t the US also ban other Chinese apps?", "discussion_type": null, "num_comments": 54, "ups": 21, "upvote_ratio": 0.87, "created_utc": 1736743229.0, "is_video": false, "selftext": "Genuinely curious but if TikTok and ByteDance “pose a national security threat to the US” then why doesn’t the US ban other ByteDance apps or other Chinese apps like Temu? Why just TikTok? \nI couldn’t find any information about this online and I’m not sure if this has already been asked here."}, {"id": "1huyhj8", "author": "Unique-Source-4744", "title": "Beware of this scam guys!!", "discussion_type": null, "num_comments": 6, "ups": 19, "upvote_ratio": 0.96, "created_utc": 1736168545.0, "is_video": false, "selftext": "Someone messaged me about 30 minutes ago asking me to vote for them in a music show. I was like yeah sure and the said it wouldn't work if I didn't use the email to my tiktok account. I thought \"hmmm, that's suspicious.\" but I emailed the email to vote for them anyways. 10 minutes later I get a code in my email asking me to verify a different email to my account. Do they think I'm that stupid?"}, {"id": "1i2ne0v", "author": "Tokkelz", "title": "Why is my TikTok buggy/ broken", "discussion_type": null, "num_comments": 35, "ups": 8, "upvote_ratio": 0.83, "created_utc": 1737028940.0, "is_video": false, "selftext": "My TikTok just randomly started being weird, if I view the videos my friends send it says the video is unavailable(applies to every new video they will send also) and I can’t repost anymore "}, {"id": "1hsa86q", "author": "Lexa_Con", "title": "Is there any way to download bookmarked TikToks BY COLLECTION?", "discussion_type": null, "num_comments": 1, "ups": 7, "upvote_ratio": 1.0, "created_utc": 1735866863.0, "is_video": false, "selftext": "As the title says, I know the app is being banned in my country in just a little over two weeks and I’d like to save all the useful TikToks I’ve bookmarked, ideally without then having to re-sort them because I’ve bookmarked quite a lot 😅 \n\nThanks in advance!!!!"}, {"id": "1hyq3gb", "author": "Old_Bike_5235", "title": "Hey guys if we all put down $20 we could buy tiktok 🙂‍↕️😃", "discussion_type": null, "num_comments": 3, "ups": 5, "upvote_ratio": 0.67, "created_utc": 1736577543.0, "is_video": false, "selftext": "Ok I’m totally joking but I’m not ready to let go of tiktok 🙁"}, {"id": "1hnfp33", "author": "Ouija_Bored_666", "title": "I don't know who the shop thinks it's advertising to, but it is NOT me", "discussion_type": null, "num_comments": 24, "ups": 16, "upvote_ratio": 0.94, "created_utc": 1735308737.0, "is_video": false, "selftext": ""}, {"id": "1hzfww1", "author": "Krelic_Ven", "title": "Saving all my Liked/Faves", "discussion_type": null, "num_comments": 2, "ups": 4, "upvote_ratio": 0.83, "created_utc": 1736660311.0, "is_video": false, "selftext": "Okay, so since TikTok is basically gonna be removed from the US, there is a lot of clips that I have liked/favored that I really don’t want to loose. Is there any app/website where I can basically download all the clips that I liked/favored without having to go through each one individually?"}, {"id": "1hvdlz6", "author": "CollinMS18", "title": "The world has gone too soft ", "discussion_type": null, "num_comments": 10, "ups": 9, "upvote_ratio": 0.84, "created_utc": 1736207155.0, "is_video": false, "selftext": "I think the picture speaks for itself…. I still don’t understand why this comment was taken down\n"}, {"id": "1i1r8cl", "author": "Applepie752", "title": "The tiktok ban is almost here", "discussion_type": null, "num_comments": 151, "ups": 31, "upvote_ratio": 0.58, "created_utc": 1736921635.0, "is_video": false, "selftext": ""}, {"id": "1hn2lzo", "author": "Desperate-Stop-42", "title": "Anything I say “Elon” related TikTok removes and flags my account. Be careful", "discussion_type": null, "num_comments": 64, "ups": 34, "upvote_ratio": 0.78, "created_utc": 1735260060.0, "is_video": false, "selftext": ""}, {"id": "1i0b53h", "author": "Nice-Ground-5124", "title": "The tiktok comments are getting out of hand", "discussion_type": null, "num_comments": 1, "ups": 9, "upvote_ratio": 0.91, "created_utc": 1736764347.0, "is_video": false, "selftext": "Literally some of Europeans people are making fun of Asian people calling them cats and dogs eaters LITERALLY I can't avoid these types of comments and some of them are bypassing the n-word when they're in argument. Tiktok should have a real moderators not bots because these people are discrimating black people and asian people and they thought these racist jokes are funny "}, {"id": "1huvlds", "author": "Adorable-Effect-2520", "title": "Is the 2020-thing here to stay?", "discussion_type": null, "num_comments": 4, "ups": 5, "upvote_ratio": 0.86, "created_utc": 1736157234.0, "is_video": false, "selftext": "I saw someone say that it's just a trend, and that makes me sad. I've cried tears of happiness having these sounds back, people doing the dances, all the colors etc. and it worries me if this is just a trend and not here to stay."}, {"id": "1hxqztd", "author": "radiatejuniorrr", "title": "U.S tiktokers with a big following: are you scared of the ban? do you care about losing your followers?", "discussion_type": null, "num_comments": 60, "ups": 14, "upvote_ratio": 0.74, "created_utc": 1736466669.0, "is_video": false, "selftext": ""}, {"id": "1hxzmud", "author": "Mikyuu665", "title": "TikTok, come on 😒", "discussion_type": null, "num_comments": 7, "ups": 8, "upvote_ratio": 0.7, "created_utc": 1736496330.0, "is_video": false, "selftext": "Appeal was denied quick. Like come on…I’m not wrong…\n\nOff topic; any mods on this subreddit? If so and you see this, please look at the messages…"}, {"id": "1i0bfcn", "author": "passionpasha", "title": "I’m sick and tired of our (🇺🇸) politicians", "discussion_type": null, "num_comments": 255, "ups": 393, "upvote_ratio": 0.86, "created_utc": 1736765632.0, "is_video": false, "selftext": "America is incredibly corrupt, and it baffles me that people haven’t taken to the streets to protest the blatant corruption. Politicians couldn’t give a damn about our data,they only care about protecting the data of high-profile individuals and VIPs. They already have all our data and spy on us constantly, as Edward Snowden exposed. They don’t give a sh*t if China blackmails us; their real concern is their own politicians and military personnel.\n\nI fckn hate politics because it screws over the common man the most. I built a career on TikTok Shop, and now I’m shtting bricks. There are way bigger issues in this country than a damn app: wildfires, hurricanes, homelessness, organized crime, and a new dr*g epidemic. Yet this is what they choose to target?\n\nOur system is f*ckd, and not enough people are calling it out for what it is…either they’re too blind to see it, or they just don’t care. If we were in Asia or South America, we’d be labeled as a corrupt nation, but because we’re the “United States of America,” nobody bats a damn eye."}, {"id": "1hz0p68", "author": "Jibrish", "title": "Doomsday post", "discussion_type": null, "num_comments": 153, "ups": 83, "upvote_ratio": 0.91, "created_utc": 1736615898.0, "is_video": false, "selftext": "The end is coming. "}, {"id": "1htz6qs", "author": "Seethcoomers", "title": "Clearly I've gone too far", "discussion_type": null, "num_comments": 57, "ups": 41, "upvote_ratio": 0.75, "created_utc": 1736056987.0, "is_video": false, "selftext": "Seriously, the moderation on this platform is garbage. Was a literal reply to someone saying, \"The heathens will suffer and learn.\"\n\nMany examples of this, probably some of the worst moderation I've ever seen on a platform - especially when game the content is stolen."}, {"id": "1i38gcb", "author": "Training-Stable6234", "title": "This is what y’all Americans will see on the 19th of January ", "discussion_type": null, "num_comments": 179, "ups": 181, "upvote_ratio": 0.93, "created_utc": 1737088369.0, "is_video": false, "selftext": ""}, {"id": "1i26vf6", "author": "stan_tripleS", "title": "People on YT shorts and other platforms are pissing me off about the ban", "discussion_type": null, "num_comments": 20, "ups": 10, "upvote_ratio": 0.6, "created_utc": 1736972760.0, "is_video": false, "selftext": "I scrolled through a couple shorts detailing the TikTok ban and the migration to RedNote and IFSTG those people in the comment section pissed me off.\n\nThey believe by going on another app that has WORSE brainrot than TikTok they suddenly have a superiority complex over everyone that uses TikTok. A few people said it was good that the ban was happening, describing how the generation can have less brainrot... like you're on an iPad typing on YT shorts so bffr. YouTube shorts is practically the same as TikTok apart from the fact that shorts usually have significantly more content/detail but that doesn't make the brainrot any better.\n\nAlso this is just a rant so if I sound high then don't mind it"}, {"id": "1i1tbe9", "author": "TinyPuddin97710", "title": "Meta", "discussion_type": null, "num_comments": 0, "ups": 5, "upvote_ratio": 1.0, "created_utc": 1736931093.0, "is_video": false, "selftext": ""}, {"id": "1i1m31v", "author": "No-Nefariousness9996", "title": "Will the ban do anything to our accounts?", "discussion_type": null, "num_comments": 34, "ups": 14, "upvote_ratio": 0.94, "created_utc": 1736904177.0, "is_video": false, "selftext": "I'm an American and I plan to take a gap year in Scotland in four months. I'm assuming that since I won't be in the states, I can use Tiktok freely, but I'm also worried about the ban doing something like archiving our accounts and making them inaccessible. I don't really think it will, but I also don't know how the banning process works so I don't trust my own judgement. Can someone who knows more than me either confirm or deny my suspicions?"}, {"id": "1hr5ujj", "author": "WorriedEagle34", "title": "Does this mean they blocked me or their account is deactivated?", "discussion_type": null, "num_comments": 19, "ups": 5, "upvote_ratio": 0.67, "created_utc": 1735747650.0, "is_video": false, "selftext": ""}, {"id": "1hs29kc", "author": "Beautiful_Rock3038", "title": "Why are the followers gained so low ?", "discussion_type": null, "num_comments": 17, "ups": 6, "upvote_ratio": 1.0, "created_utc": 1735846609.0, "is_video": false, "selftext": ""}, {"id": "1i3809k", "author": "QueerKing23", "title": "Americans love something new", "discussion_type": null, "num_comments": 11, "ups": 4, "upvote_ratio": 0.67, "created_utc": 1737086821.0, "is_video": false, "selftext": "Even if tik tok gets saved somehow they've still lost the crowd \n\nIs everyone basically gone for good even if tik tok isn't banned the majority of folks have already switched and are having fun making friends over here on red note"}, {"id": "1i1mng5", "author": "NoGrass7120", "title": "What will happen to the music industry in the USA when TikTok gets banned?", "discussion_type": null, "num_comments": 52, "ups": 4, "upvote_ratio": 0.55, "created_utc": 1736905905.0, "is_video": false, "selftext": "Knowing that TikTok will probably be banned in the US on January 19th, how is the music industry and musicians going to deal/cope with this? Especially knowing that the USA has the most musical pull on the entire planet, how could music in general be affected as well? You have artists that have full fledged careers thanks to TikTok (some of them get the unfair \"TikTok artist\" label too)."}, {"id": "1i19jwc", "author": "idk-a-username_", "title": "question about the usa server shut down :", "discussion_type": null, "num_comments": 4, "ups": 4, "upvote_ratio": 0.84, "created_utc": 1736871156.0, "is_video": false, "selftext": "I made my account in Canada back in 2016 (still musically). This year, I’ve moved to the United States. Will all of my videos be deleted now that I’m in America or am I safe from the ban since my account is based in Canada?"}, {"id": "1hq2uxf", "author": "ResponseOrdinary1493", "title": "Dec 31 …Mass unfollow, no gifts, unsubscribing from Ashley Trevino 2025 you’re not coming into 2025 ", "discussion_type": null, "num_comments": 1, "ups": 6, "upvote_ratio": 0.81, "created_utc": 1735607208.0, "is_video": false, "selftext": ""}, {"id": "1hxjj29", "author": "LiveToSlamExalts", "title": "Triller launches a tool to back up users' TikToks ahead of the US ban deadline\n", "discussion_type": null, "num_comments": 0, "ups": 4, "upvote_ratio": 0.83, "created_utc": 1736447342.0, "is_video": false, "selftext": "[https://finance.yahoo.com/news/triller-launches-tool-back-users-171906634.html](https://finance.yahoo.com/news/triller-launches-tool-back-users-171906634.html)"}, {"id": "1hzuzzj", "author": "CerbSideCombo", "title": "Is anyone else going to Tumblr after the Tiktok ban?", "discussion_type": null, "num_comments": 64, "ups": 20, "upvote_ratio": 0.75, "created_utc": 1736710966.0, "is_video": false, "selftext": "I really don't like Meta (Facebook, Instagram, Whatsapp) they steal information and suspend you for NO REASON. It's literally happened to me on all their platforms. YouTube shorts is booty, and Twitter (not calling it X) is freaking corrupt. \n\nI think we should give Tumblr another chance, it's kind of underrated in my opinion, and it's not a new app. It's been around for over a decade. What do y'all think?"}, {"id": "1hzdx5k", "author": "Friskybish", "title": "Is this where we mobilize? ", "discussion_type": null, "num_comments": 15, "ups": 22, "upvote_ratio": 0.81, "created_utc": 1736653257.0, "is_video": false, "selftext": "We need a place for TikTok users to come together and mobilize that’s NOT a Meta app. Could we make this that place for now? \n\nEdit: I just started a new community page if this page isn’t the right place for our needs. Check it out: https://www.reddit.com/r/TikTokMobilize/s/J9PqdLLErZ"}, {"id": "1hqh5e6", "author": "50calDerringer", "title": "Click for Click - Tiktok Referral Megathread", "discussion_type": null, "num_comments": 3956, "ups": 19, "upvote_ratio": 0.91, "created_utc": 1735659418.0, "is_video": false, "selftext": "Thread is sorted by newest. Post your links. You can post them multiple times but if you don't space it out (I'd say at least 30 minutes) you risk reddit spam banning you.\n\nDon't know what's going on? Log into your app. Go to your profile. There should be a little event icon to click (Varies by phone, play around). That has a referral link. Post that in this thread, click other peoples links (Don't be an ass it only takes a second!). This will reward you with up to $70 tiktok shop credit. Enjoy.\n\nThis is a refresh as the other thread is getting old.\n\n**AVOIDING THIS THREAD FOR REFERRALS WILL RESULT IN A BAN FOR THE REST OF THE EVENT**"}, {"id": "1i0gere", "author": "Pure_Taste_3044", "title": "Why can't i receive rednote code ", "discussion_type": null, "num_comments": 5, "ups": 4, "upvote_ratio": 0.83, "created_utc": 1736781941.0, "is_video": false, "selftext": ""}, {"id": "1i10jjq", "author": "LuboldianKingdom", "title": "Since TikTok is getting banned, does anyone wanna work together to make an app like this?", "discussion_type": null, "num_comments": 17, "ups": 3, "upvote_ratio": 0.64, "created_utc": 1736838665.0, "is_video": false, "selftext": ""}, {"id": "1i2bxgs", "author": "MimicGamingH", "title": "Best video editing app after tiktok?", "discussion_type": null, "num_comments": 8, "ups": 7, "upvote_ratio": 0.89, "created_utc": 1736986309.0, "is_video": false, "selftext": "I only started making content online because of how simple and intuitive Tiktok made the process from allowing you to record in the app using built in green screen filters to the automated captions all within the app. I wanna know what the best alternative is with those features once tiktok gets banned"}, {"id": "1hyjlvz", "author": "frydplatanos", "title": "So… where we goin’?", "discussion_type": null, "num_comments": 48, "ups": 15, "upvote_ratio": 0.72, "created_utc": 1736555696.0, "is_video": false, "selftext": "TikTok’s expiration date is on January 19th… where we all goin’? 😭\n\nSeparate issue: I wanna be a content creator but IG Reels is just… not it. YouTube Shorts is just recycled content and oversaturated. Twitter… no. What are we going to dooooo"}, {"id": "1hp5nfv", "author": "DoItForTheOH94", "title": "TikTok lives more and more frequent", "discussion_type": null, "num_comments": 3, "ups": 4, "upvote_ratio": 0.84, "created_utc": 1735505901.0, "is_video": false, "selftext": "Not only do I get a TikTok live about every 5 videos, but it's 2-3 lives in a row. I have to scroll past more and more lives, just now it was actually 4. I don't even watch them, I wish I could turn them off. My wife said she gets very few TikTok lives. How do I reset my algorithm?"}, {"id": "1hx5046", "author": "Green_Benefit7158", "title": "Can someone explain how using this emoji 🤢 goes against community guidelines?", "discussion_type": null, "num_comments": 11, "ups": 7, "upvote_ratio": 0.73, "created_utc": 1736397796.0, "is_video": false, "selftext": "It was a response to a funny and somewhat gross comment and I get a notification saying it went against community guidelines. 🤦🏻‍♀️"}, {"id": "1hmgcvs", "author": "Shinosei", "title": "People can be antisemitic, racist and whatever on this app but I can’t even call someone a donkey.", "discussion_type": null, "num_comments": 48, "ups": 43, "upvote_ratio": 0.91, "created_utc": 1735185672.0, "is_video": false, "selftext": ""}, {"id": "1i25p5z", "author": "montgomery2016", "title": "I'm glad TikTok is disappearing for a very selfish reason ", "discussion_type": null, "num_comments": 43, "ups": 46, "upvote_ratio": 0.67, "created_utc": 1736969693.0, "is_video": false, "selftext": "I made my first account in 2019 and by god I was cringe. Bad lip syncs, breakup posts, stupid trends. I lost access to the account and have not been able to recover it. Once the app is gone my greatest shame will be wiped away once and for all. \n\nA small price to pay for salvation. "}, {"id": "1hy7opt", "author": "yuriwae", "title": "I'm so tired of live videos", "discussion_type": null, "num_comments": 9, "ups": 22, "upvote_ratio": 0.81, "created_utc": 1736524912.0, "is_video": false, "selftext": "Why do we need them in the fyp at all?? There's a button there to look at the lives IF WE WANT, but we STILL get forced to see random live videos we never wanted to see. Like stop showing me a random armless Nigerian woman please, and people with severe disabilities it's fucking weird why do I get spammed with it I never interact with them I just block them BC it's most definitely NOT what I want on my fyp but I just keep getting it 😭"}, {"id": "1hs7jkv", "author": "_Dapper_Cat_", "title": "Why does my TikTok look like this?", "discussion_type": null, "num_comments": 7, "ups": 13, "upvote_ratio": 0.94, "created_utc": 1735859700.0, "is_video": false, "selftext": "I just created my account, and I can’t do anything with it…"}, {"id": "1i2har0", "author": "Serious_Tomatillo895", "title": "LOL! They are promoting REDnote on TIKTOK as an AD!", "discussion_type": null, "num_comments": 2, "ups": 26, "upvote_ratio": 0.91, "created_utc": 1737003039.0, "is_video": false, "selftext": "I think TikTok is hinting at something guys..."}, {"id": "1i0t40a", "author": "Medical_Badger495", "title": "Tik Tok Ban is so Stupid (This will be a long caption) ", "discussion_type": null, "num_comments": 44, "ups": 15, "upvote_ratio": 0.63, "created_utc": 1736814090.0, "is_video": false, "selftext": "The way Shou Zi Chew has to defend his platform because a bunch of old men don’t understand he has nothing to do with the Chinese communist party is so dumb. This man is trying to talk common sense to the senators and they have no idea what’s going on. For example. Shou Zi explains how filters work, they do not collect Face ID data and sell it the the Chinese government, they simply track the eyes of the person to apply something innocent like glasses. for some reason, the senator (I don’t know his name) can’t comprehend that, he calls it “creepy”  how it tracks your face, so apparently he has never heard of Snapchat or YouTube’s filters, or any other app including that. Another example, a different senator kept cutting off Shou Zi’s words, asking if he had anything to do with the Chinese, he simply explained he was Singaporean and does NOT have a Chinese citizenship. These dumb racists and xenophobic people are taking down a completely fine app down, because the ceo (looks) Chinese. Meanwhile, they aren’t doing anything about school shootings, or another bad app, (OF). I can prove they aren’t doing anything about it because my school just got another shooting threat, and it’s supposed to happen tomorrow, me and others are scared to go to school, meanwhile the US government acts like they don’t see it and point out a perfectly fine app, and take it down. "}, {"id": "1i0zuu1", "author": "BillWonginSoochow", "title": "Why so many people on RedNotes?", "discussion_type": null, "num_comments": 15, "ups": 16, "upvote_ratio": 0.94, "created_utc": 1736835776.0, "is_video": false, "selftext": "Excuse me. I’m Chinese. So many English users suddenly appears on my RedNotes App. What happened? Are they truly American Users? If so why don’t they use the Chinese TikTok?"}, {"id": "1i2pka5", "author": "Moogly2021", "title": "TikTok CEO Planning to Attend Trump’s Inauguration", "discussion_type": null, "num_comments": 108, "ups": 56, "upvote_ratio": 0.88, "created_utc": 1737036126.0, "is_video": false, "selftext": ""}, {"id": "1hm3cik", "author": "timetobakethebiscuit", "title": "Doing this again", "discussion_type": null, "num_comments": 196, "ups": 7, "upvote_ratio": 0.66, "created_utc": 1735142741.0, "is_video": false, "selftext": "https://www.tiktok.com/t/ZTYsYRse1/"}, {"id": "1hk8f6t", "author": "85EnderPortals_YT", "title": "TikTok is experiencing another 12/22", "discussion_type": null, "num_comments": 1, "ups": 6, "upvote_ratio": 1.0, "created_utc": 1734903552.0, "is_video": false, "selftext": "Geez,the moderation this month must have been getting worse. Because there's so much Gore and Prn being masked with AI and lots of people getting warnings or strikes from basic comments. I'm not really upset of TikTok getting banned anymore."}, {"id": "1hyjyrj", "author": "CaughtUpInTheTide", "title": "Editors of tik tok, are you sad about the possible ban? ", "discussion_type": null, "num_comments": 10, "ups": 4, "upvote_ratio": 0.64, "created_utc": 1736556759.0, "is_video": false, "selftext": "As someone who migrated from Vine to IG to tik tok to edit, it's been sad to see all that hard work from over the years disappear. I remember it happening with Vine which sucked because IG was not the same. Now with tik tok maybe being banned for good, idk anymore. \n\nAlso I feel like the ban will happen, and I think it's good for mental health to get rid of it however it was still a creative outlet for many..."}, {"id": "1i1ykg9", "author": "TravelerofAzeroth", "title": "Billionaires buying Tiktok", "discussion_type": null, "num_comments": 124, "ups": 83, "upvote_ratio": 0.81, "created_utc": 1736951319.0, "is_video": false, "selftext": "If Musk buys Tiktok, I'm out regardless. Can't trust him or his companies anymore."}, {"id": "1hxdr8t", "author": "ballisticballs34", "title": "TikTok censoring comments for no reason", "discussion_type": null, "num_comments": 50, "ups": 62, "upvote_ratio": 0.97, "created_utc": 1736432276.0, "is_video": false, "selftext": "there is no amount of context to justify banning a comment like this😂😂 ive seen actual nudity on there but i cant comment this?? tiktok is such a joke lmao"}, {"id": "1i020na", "author": "anxious-human-bean5", "title": "Should we be deleting our TikTok accounts?", "discussion_type": null, "num_comments": 57, "ups": 32, "upvote_ratio": 0.85, "created_utc": 1736729792.0, "is_video": false, "selftext": "If TikTok is banned on the 19th and TikTok stops being hosted on United States servers (so that VPNs don’t work and you would need a foreign phone number and internet connection in order to use the app), should we be deleting our accounts? I’m worried about my account being hacked/my password being leaked while I have no access to it after the ban. Or should I leave my account up in case it ever gets unbanned?\n\nEdit because most of you are missing the point: China already has my data. I’ve accepted it because every company I have an account with also has my data. I’m not worried about my data, I just don’t want people to hack into my account (whether they got the info from the Chinese government or not) while I can’t access it since it’s likely that TikTok will just be shutting our servers down. The point is that I don’t want someone in my account using my identity to post things. Also, this isn’t the place to debate whether it’s getting banned (there are other threads discussing this) so why are you guys screaming that it won’t happen? I’m just planning for the possibility that it will as a security conscious person. It’s not that deep. Take a deep breath everybody."}, {"id": "1i2no9b", "author": "angel_baby222", "title": "Is TikTok down right now?", "discussion_type": null, "num_comments": 14, "ups": 7, "upvote_ratio": 0.74, "created_utc": 1737029999.0, "is_video": false, "selftext": "Been trying to watch the videos my friends sent and all the videos are black and say “Sorry, this is unavailable”. The same thing is happening with my friends.\n\nIs the app crashing right now?"}, {"id": "1hyu5j1", "author": "Infinite_1432", "title": "I search up the water challenge and I got this??", "discussion_type": null, "num_comments": 5, "ups": 4, "upvote_ratio": 0.83, "created_utc": 1736595647.0, "is_video": false, "selftext": ""}, {"id": "1hhtx1t", "author": "Pineapplechickens0", "title": "EVERYTHING Banned for no reason", "discussion_type": null, "num_comments": 21, "ups": 8, "upvote_ratio": 0.79, "created_utc": 1734618049.0, "is_video": false, "selftext": "I literally wake up this morning and my account is taken down for my age?? I’m 18. I confirmed it with my ID all is good and I’m back in my account. I’m looking at my videos and like more than half of my videos have been deleted because of a community guidelines violation. 52 of my videos that have been there for weeks, months, and YEARS are now gone for what reason? There is some with my boyfriend, my family, my pets, none of them are against the guidelines they’ve been up for so long and now I have no way of getting my videos back. I’m so beyond sad and angry. What do I do now "}, {"id": "1hyp1h7", "author": "propertyowned", "title": "Lemon8", "discussion_type": null, "num_comments": 6, "ups": 23, "upvote_ratio": 0.87, "created_utc": 1736573374.0, "is_video": false, "selftext": "This is just a reminder that if TikTok gets banned, Lemon8 will be as well. ByteDance in it's entirety is what's actually getting banned and that means all apps associated with it as well. Given they dont divest. And honestly I don't see them caving. "}, {"id": "1i1gomj", "author": "MouseAny1262", "title": "TikTok Alternative", "discussion_type": null, "num_comments": 5, "ups": 6, "upvote_ratio": 0.88, "created_utc": 1736889358.0, "is_video": false, "selftext": "Just wanted to share the app Clapper which may be an alternative for US folks, it’s been based off of TikTok.  "}, {"id": "1hrctja", "author": "Aplexio", "title": "What is this?", "discussion_type": null, "num_comments": 2, "ups": 5, "upvote_ratio": 0.78, "created_utc": 1735766384.0, "is_video": false, "selftext": "Can someone explain to me what this is? Do I get a verified badge if I do this or what is this for?"}, {"id": "1hk8i4e", "author": "RestlessRhys", "title": "Are you joking that entire account is posting CP and TikTok is ok with it?", "discussion_type": null, "num_comments": 10, "ups": 5, "upvote_ratio": 0.86, "created_utc": 1734903790.0, "is_video": false, "selftext": ""}, {"id": "1hydocl", "author": "Shadegloom", "title": "Is there any hope?", "discussion_type": null, "num_comments": 452, "ups": 85, "upvote_ratio": 0.65, "created_utc": 1736539895.0, "is_video": false, "selftext": "Hey! \n\nJust wanted to stop by. Is there really no hope for tiktok? I love it. I have fun and laugh and learn. I met my best friends there. And now...to lose it seems...sad.\n\nI just cannot stand YouTube nor Instagram for my videos. Never get the same funny interactions.\n\nThe negativity some people claim comes from it is from loud people.\n\nBut, what about those of us who just want to make people laugh. To smile. Life is fucking miserable. \n\nAnyone have something wholesome or good to share? Maybe encouragement to find something else?"}, {"id": "1hzse6o", "author": "Packofcells", "title": "I'm not American and I'll delete Tiktok if it gets banned from America. ", "discussion_type": null, "num_comments": 409, "ups": 355, "upvote_ratio": 0.75, "created_utc": 1736704399.0, "is_video": false, "selftext": "I can't imagine how my fyp would look like without Americans, most people and content creators I follow are americans and I'm literally thinking of deleting tiktok if the US government bans it. "}, {"id": "1hok5x3", "author": "zacaboy", "title": "I JUST GOT MY FIRST 10 THOUSAND VIEW VIDEO!!!", "discussion_type": null, "num_comments": 36, "ups": 72, "upvote_ratio": 0.92, "created_utc": 1735433854.0, "is_video": false, "selftext": "I'm so excited right now I've only ever gotten close to it but never actually got it, I'm just amazed right now."}, {"id": "1i1lbhu", "author": "FUCKTHE-NCR", "title": "found this crap ", "discussion_type": null, "num_comments": 1, "ups": 7, "upvote_ratio": 0.89, "created_utc": 1736901935.0, "is_video": false, "selftext": ""}, {"id": "1hvwwzy", "author": "JustGabe03", "title": "Found this on my nana’s kitchen window from 1999 lol", "discussion_type": null, "num_comments": 11, "ups": 21, "upvote_ratio": 0.97, "created_utc": 1736271359.0, "is_video": false, "selftext": ""}, {"id": "1hyn5ck", "author": "KurlyKev", "title": "Any way I can transfer all TikTok vids I’ve saved onto a cloud or something? ", "discussion_type": null, "num_comments": 11, "ups": 8, "upvote_ratio": 0.83, "created_utc": 1736566761.0, "is_video": false, "selftext": "I have over 10K vids saved and I’d rather go back and watch them than use other apps. Any way I can save them all automatically? Please "}, {"id": "1hnaeee", "author": "thatanimekid818", "title": "TIKTOK SEARCH FROZEN", "discussion_type": null, "num_comments": 19, "ups": 20, "upvote_ratio": 0.95, "created_utc": 1735287533.0, "is_video": false, "selftext": "So when I search something up results appear but the screen gets frozen. When I try to close the app and open it and I attempt to search something again it still freezes. Has this happened to anyone before? If so, is there anyway to fix this l?"}, {"id": "1hzs0w0", "author": "blumpkingagger", "title": "Is Lemon8 also getting banned?", "discussion_type": null, "num_comments": 20, "ups": 5, "upvote_ratio": 0.78, "created_utc": 1736703464.0, "is_video": false, "selftext": "Since Bytedance owns both of them? "}, {"id": "1hvh1e3", "author": "brandonbullet", "title": "Search highlights are done with me", "discussion_type": null, "num_comments": 1, "ups": 3, "upvote_ratio": 0.81, "created_utc": 1736216810.0, "is_video": false, "selftext": ""}, {"id": "1hyr272", "author": "AdOrnery1628", "title": "banned with no warning or explanation?", "discussion_type": null, "num_comments": 6, "ups": 4, "upvote_ratio": 0.7, "created_utc": 1736581768.0, "is_video": false, "selftext": "I’ve had my tik tok account for over a year now. I was scrolling and was given a pop up saying that I have been permanently banned for being under the age of 13. I am not 13 and submitted my drivers license to prove this. Is there any hope that I can get the account back? It’s where all of my art is posted to:("}, {"id": "1i302oy", "author": "BA_in_SoMD", "title": "No ban expected via Under the Desk News!!!!", "discussion_type": null, "num_comments": 73, "ups": 31, "upvote_ratio": 0.64, "created_utc": 1737063439.0, "is_video": false, "selftext": "Just saw this TikTok!!!! Doesn’t look like the SC will give any more decisions this week and Bidens team is looking at what they can do to stop the ban. So it’s not 100% but….\n\nhttps://www.tiktok.com/t/ZT2Jxmpxr/\n\nAlso another TT from Aaron Parnas who says Biden will not enforce the ban on the 19th:\n\nhttps://www.tiktok.com/t/ZT2JxSwRJ/"}, {"id": "1i1hkzq", "author": "foslforever", "title": "Can you access TIKTOK with TOR or a VPN?", "discussion_type": null, "num_comments": 31, "ups": 5, "upvote_ratio": 0.69, "created_utc": 1736891685.0, "is_video": false, "selftext": "I'm trying to figure out how 170 million americans are going to access Tiktok now that the US Govt has decided to implement chinese censorship policies to protect us from the worlds largest app"}, {"id": "1i1kz2c", "author": "HouseofIvory", "title": "Best way to save all my videos?", "discussion_type": null, "num_comments": 17, "ups": 6, "upvote_ratio": 1.0, "created_utc": 1736900908.0, "is_video": false, "selftext": "What’s the best way to save all my videos? It’s such a pain to do it one by one especially considering how many I have posted 😭.\n\nDoes anyone know if TikTok has this feature and I’m just not seeing it!!! \n\nNervous I will lose all my videos due to the ban!"}, {"id": "1hwaxf7", "author": "rabidfusion", "title": "Real reason for TikTok ban leaked.", "discussion_type": null, "num_comments": 24, "ups": 32, "upvote_ratio": 0.79, "created_utc": 1736308899.0, "is_video": false, "selftext": ""}, {"id": "1i0eisi", "author": "Putridlemons", "title": "For those who have migrated to REDnote and are able to post.", "discussion_type": null, "num_comments": 20, "ups": 13, "upvote_ratio": 0.85, "created_utc": 1736776674.0, "is_video": false, "selftext": "REDnote seems like a good alternative if the Tiktok ban does get approved by the Supreme Court for January 19th.\n\nI myself have downloaded the app, set up my account, and it looks promising. However, I cannot upload a single god damn video, and I have NO idea why.\n\nThrew in one of my 18 second videos that I had already posted to Tiktok, and this is how it goes:\n\n- I HAVE to keep the app open in order for the progress bar to move.\n\n- It takes like 15 minutes just for the bar to get to like 25% complete, only for the app to crash.\n\n- If I open any other app, visit any other app, or change the window I'm on, the video will stop uploading and get thrown back into drafts. The second I re-open the app, it starts to try and upload again. I can't delete it.\n\nI've verified my number correctly, I've changed my username and personalized my account, I see so many other Americans uploading their videos and posts from Tiktok to REDnote and I have no idea how they're doing it. Is anyone else having the same issue? \n\n"}, {"id": "1i0w5kh", "author": "DefinetelyNotBlaze", "title": "Well, it’s possible", "discussion_type": null, "num_comments": 36, "ups": 60, "upvote_ratio": 0.78, "created_utc": 1736822984.0, "is_video": false, "selftext": ""}, {"id": "1hro5wd", "author": "Inevitable-Soft3510", "title": "Hacked accounts ", "discussion_type": null, "num_comments": 5, "ups": 4, "upvote_ratio": 0.75, "created_utc": 1735801831.0, "is_video": false, "selftext": "There is a loophole that hackers or bots can do, and i think it happened to me because I was logged out of my account and can't log in with any password or email i have ever used. They log in with the password, then delete the saved phone number or email from the account. This way, you (original account owner) can't change the password from the phone number or email. I want my account back, I don't understand how it would have been hacked, it is literally a private account with like 50 followers. "}, {"id": "1hw77m0", "author": "RoundAd2821", "title": "Where are we all going after the ban", "discussion_type": null, "num_comments": 59, "ups": 17, "upvote_ratio": 0.87, "created_utc": 1736297685.0, "is_video": false, "selftext": ""}, {"id": "1i0sr73", "author": "mp14_", "title": "Instead of migrating to a new app, cant we use the web app?", "discussion_type": null, "num_comments": 3, "ups": 5, "upvote_ratio": 0.86, "created_utc": 1736813107.0, "is_video": false, "selftext": "Why dont we just do what GeForce Now users did and save the web app to our home screen. Then you will still get updates and still have the same algorithm."}, {"id": "1hn0wt8", "author": "DeadpanToucan", "title": "Why do people believe this nonsense?", "discussion_type": null, "num_comments": 1, "ups": 6, "upvote_ratio": 0.88, "created_utc": 1735255133.0, "is_video": false, "selftext": "There's this guy who uses the same prerecorded 'live' stream of himself, presumably using a random coordinate generator, to apparently track down people's houses that are on the stream. I've personally seen him use at least 12 different accounts to do this to potentially evade bans (again, only presuming). Currently he's streaming using the tag 'surreal_beautiful_' to stream. Also, I have suspicions he is buying followers so he can access live streaming on each account."}, {"id": "1hnsd0l", "author": "No_Heart6564", "title": "President-Elect Donald Trump files a request to the Supreme Court to pause January 19 deadline", "discussion_type": null, "num_comments": 8, "ups": 17, "upvote_ratio": 0.9, "created_utc": 1735342863.0, "is_video": false, "selftext": "The President-Elect of the United States, Donald Trump, in a new filing is requesting to pause the Jan 19 deadline after meeting with the TikTok CEO.\nThere’s hope."}, {"id": "1i0o9xn", "author": "BeautifulSecure4058", "title": "What do you think of TikTok refugees flooding into Rednote?", "discussion_type": null, "num_comments": 398, "ups": 161, "upvote_ratio": 0.84, "created_utc": 1736801472.0, "is_video": false, "selftext": ""}, {"id": "1i27nha", "author": "Ok-Client3554", "title": "So i guess we're getting a delay ", "discussion_type": null, "num_comments": 164, "ups": 42, "upvote_ratio": 0.62, "created_utc": 1736974806.0, "is_video": false, "selftext": ""}, {"id": "1hyjw0z", "author": "RadiantAide7351", "title": "As a non-American tiktok user, what will happen to the saved/favourited videos posted by creators in the US? ", "discussion_type": null, "num_comments": 7, "ups": 9, "upvote_ratio": 1.0, "created_utc": 1736556527.0, "is_video": false, "selftext": "People have said that all the content will stay up, but some say otherwise. Is there a clear answer? "}, {"id": "1i12iwa", "author": "redbutlert", "title": "Everyone on rednote rn", "discussion_type": null, "num_comments": 1, "ups": 9, "upvote_ratio": 0.92, "created_utc": 1736847685.0, "is_video": false, "selftext": ""}, {"id": "1hmlzsn", "author": "satinsouled", "title": "appeal denied bc i think spongebobs dad is hot 😭", "discussion_type": null, "num_comments": 5, "ups": 9, "upvote_ratio": 0.92, "created_utc": 1735210081.0, "is_video": false, "selftext": "i think they misunderstood me and think i was saying \"like that's a man\" as if he's not and i wasnt!! (altho tbf he's not, he's a sponge). BUT i meant this in an \"i would F him\" way Yk? like \"like THAT'S a man!!\" POSITIVE. PLease can i explain this and get this reversed somehow?? 😭"}, {"id": "1hnnhtm", "author": "SalamiHolster", "title": "TikTok Doesn't Allow You To Say \"Free Luigi.\"", "discussion_type": null, "num_comments": 209, "ups": 309, "upvote_ratio": 0.89, "created_utc": 1735329676.0, "is_video": false, "selftext": ""}, {"id": "1hsoi7a", "author": "Equivalent-Pea-1592", "title": "With the TikTok ban looming in weeks, do we think it will actually be banned?", "discussion_type": null, "num_comments": 189, "ups": 38, "upvote_ratio": 0.78, "created_utc": 1735916841.0, "is_video": false, "selftext": "Initially, I thought there was no way it would get banned, but I’m now starting to think it just might actually happen. Would love to hear people’s thoughts! Also I live in Canada so what do we think the effects of the Us Ban would have on TikTok in other countries?"}, {"id": "1hqw5ry", "author": "shouldIworkremote", "title": "Will tiktok still be worth using if it gets banned in the US?", "discussion_type": null, "num_comments": 90, "ups": 7, "upvote_ratio": 0.69, "created_utc": 1735707964.0, "is_video": false, "selftext": "I know the US demographic of app users will probably significantly decrease. But would the app still be \"alive\"? Or will this effectively kill it?"}, {"id": "1hmvkg2", "author": "Mundane_Tomorrow6800", "title": "What app will be the next tik tok ? ", "discussion_type": null, "num_comments": 6, "ups": 4, "upvote_ratio": 1.0, "created_utc": 1735240478.0, "is_video": false, "selftext": "Any suggestions? "}, {"id": "1hlazxj", "author": "TwerkingStormTrooper", "title": "Ah yes, give me 40¢ please.", "discussion_type": null, "num_comments": 50, "ups": 13, "upvote_ratio": 1.0, "created_utc": 1735036593.0, "is_video": false, "selftext": ""}, {"id": "1hsw5dn", "author": "Next-Enthusiasm-2181", "title": "Why is Tiktok on pc so janky ?", "discussion_type": null, "num_comments": 4, "ups": 5, "upvote_ratio": 1.0, "created_utc": 1735936069.0, "is_video": false, "selftext": "Like seriously this is a multi billion dollar company and yet dm´s and the follow button dont work ? Its also extremly laggy for me (Yes i have a good pc)"}, {"id": "1i2fdrp", "author": "NonamePlsIgnore", "title": "US State Department Public Affairs Section obtains exception to continue using TikTok to \"contract with digital content creators\" and \"carry out monitoring and analysis\"", "discussion_type": null, "num_comments": 6, "ups": 5, "upvote_ratio": 1.0, "created_utc": 1736996695.0, "is_video": false, "selftext": ""}, {"id": "1ht226t", "author": "Specialist_Force91", "title": "Didn’t all this TikTok nonsense start under the last Trump administration ? ", "discussion_type": null, "num_comments": 81, "ups": 82, "upvote_ratio": 0.83, "created_utc": 1735951591.0, "is_video": false, "selftext": "I’m a bit confused by something, isn’t Trump the one that started this nonsense 6 years ago, yet now is the one saying he isn’t for a ban? That he's going to save it? \n\nWTF"}, {"id": "1hpq4bd", "author": "sexytoeho", "title": "Why???  How was this removed but nothing else is..? ", "discussion_type": null, "num_comments": 29, "ups": 15, "upvote_ratio": 0.94, "created_utc": 1735573859.0, "is_video": false, "selftext": "This was about a women who commented she went to the store in a wheelchair, pushed her stroller, then dragged the buggy behind her. I said that^? That's like the standard of customer service? (At least when I was in it). But she mentioned at the end that she came home to her husband still gaming?? The TikTok account is : Caylee Cresta (her most recent video) "}]